** Copy dust wave figure files to paper folder
#+BEGIN_SRC sh :results output
  FIGFILES='dust-couple-stream-annotate.pdf dust-wave-Rc-R90*.pdf dust-coupling-1d.pdf dust-divergent.pdf dust-couple-div-stream.jpg'
  date
  pwd
  for f in $FIGFILES; do
      cp -av $f ../papers/Paper1/figs 
  done
#+END_SRC

#+RESULTS:
: Fri Nov 17 18:27:25 CST 2017
: /Users/will/Work/Bowshocks/Jorge/bowshock-shape/Dust-wave
: dust-couple-stream-annotate.pdf -> ../papers/Paper1/figs/dust-couple-stream-annotate.pdf
: dust-wave-Rc-R90-error.pdf -> ../papers/Paper1/figs/dust-wave-Rc-R90-error.pdf
: dust-wave-Rc-R90.pdf -> ../papers/Paper1/figs/dust-wave-Rc-R90.pdf
: dust-coupling-1d.pdf -> ../papers/Paper1/figs/dust-coupling-1d.pdf
: dust-divergent.pdf -> ../papers/Paper1/figs/dust-divergent.pdf
: dust-couple-div-stream.jpg -> ../papers/Paper1/figs/dust-couple-div-stream.jpg

** Copy bow projection figure files to paper folder
#+BEGIN_SRC sh :results output
  FIGFILES='test_xyprime.pdf test_xyprime_*dragoid.pdf test_xyprime_ancantoid.pdf *oid-R90-vs-Rc*.pdf compare_xyprime_wave-wilkinoid.pdf wave-R90-vs-Rc-A010-N10.pdf wave-R90-vs-Rc-A005-N20.pdf wave_xyprime-A005-N20-dragoid-alpha100.pdf wave_xyprime-A005-N20-ancantoid-xi080-beta000500.pdf'
  date
  pwd
  for f in $FIGFILES; do
      cp -av $f ../papers/Paper1/figs 
  done
#+END_SRC

#+RESULTS:
#+begin_example
Fri Nov 17 18:27:37 CST 2017
/Users/will/Work/Bowshocks/Jorge/bowshock-shape/Dust-wave
test_xyprime.pdf -> ../papers/Paper1/figs/test_xyprime.pdf
test_xyprime_div_dragoid.pdf -> ../papers/Paper1/figs/test_xyprime_div_dragoid.pdf
test_xyprime_dragoid.pdf -> ../papers/Paper1/figs/test_xyprime_dragoid.pdf
test_xyprime_ancantoid.pdf -> ../papers/Paper1/figs/test_xyprime_ancantoid.pdf
ancantoid-R90-vs-Rc-a.pdf -> ../papers/Paper1/figs/ancantoid-R90-vs-Rc-a.pdf
ancantoid-R90-vs-Rc-b.pdf -> ../papers/Paper1/figs/ancantoid-R90-vs-Rc-b.pdf
ancantoid-R90-vs-Rc-lobeta-a.pdf -> ../papers/Paper1/figs/ancantoid-R90-vs-Rc-lobeta-a.pdf
dragoid-R90-vs-Rc.pdf -> ../papers/Paper1/figs/dragoid-R90-vs-Rc.pdf
three-quadric-dragoid-R90-vs-Rc.pdf -> ../papers/Paper1/figs/three-quadric-dragoid-R90-vs-Rc.pdf
wilkinoid-R90-vs-Rc-wave-A005-N20.pdf -> ../papers/Paper1/figs/wilkinoid-R90-vs-Rc-wave-A005-N20.pdf
wilkinoid-R90-vs-Rc-wave-A005-N25.pdf -> ../papers/Paper1/figs/wilkinoid-R90-vs-Rc-wave-A005-N25.pdf
wilkinoid-R90-vs-Rc-wave-A010-N10.pdf -> ../papers/Paper1/figs/wilkinoid-R90-vs-Rc-wave-A010-N10.pdf
wilkinoid-R90-vs-Rc-wave-A010-N15.pdf -> ../papers/Paper1/figs/wilkinoid-R90-vs-Rc-wave-A010-N15.pdf
wilkinoid-R90-vs-Rc-wave-A015-N07.pdf -> ../papers/Paper1/figs/wilkinoid-R90-vs-Rc-wave-A015-N07.pdf
compare_xyprime_wave-wilkinoid.pdf -> ../papers/Paper1/figs/compare_xyprime_wave-wilkinoid.pdf
wave-R90-vs-Rc-A010-N10.pdf -> ../papers/Paper1/figs/wave-R90-vs-Rc-A010-N10.pdf
wave-R90-vs-Rc-A005-N20.pdf -> ../papers/Paper1/figs/wave-R90-vs-Rc-A005-N20.pdf
wave_xyprime-A005-N20-dragoid-alpha100.pdf -> ../papers/Paper1/figs/wave_xyprime-A005-N20-dragoid-alpha100.pdf
wave_xyprime-A005-N20-ancantoid-xi080-beta000500.pdf -> ../papers/Paper1/figs/wave_xyprime-A005-N20-ancantoid-xi080-beta000500.pdf
#+end_example


*** Library ~bow_diagnostic.py~ for finding (R_c, R_90)

#+BEGIN_SRC python :eval yes :return result :tangle bow_diagnostic.py
  import numpy as np
  from astropy.table import Table
  import bow_projection as bp

  def parameter_table(inclinations, shape, *shape_args):
      """Diagnostic parameters for `inclinations` from `shape`

  Input argument `inclinations` should be a vector of angles (in
  radians) and input argument `shape` should be callable to give
  R(theta), optionally with additional arguments `shape_args`.  Example
  functions suitable for passing as `shape` can be found in the
  `bow_projection` module.

  Returns an `astropy.table.Table` of characteristic angles and radii.

      """
      rows = [bp.characteristic_radii_projected(inc, shape, *shape_args)
              for inc in inclinations]
      tab = Table(rows=rows)
      tab['inc'] = inclinations
      # Number formatting in output
      for k in tab.colnames:
          if 'theta' in k or 'inc' in k:
              # Angle columns: convert to degrees, give to 1 decimal place
              tab[k] = np.degrees(tab[k]).round(decimals=1)
          else:
              # Radii columns: give to 4 decimal places
              tab[k] = tab[k].round(decimals=4)
      return tab


  if __name__ == '__main__':
      bp.DEBUG = True
      th_inf = bp.theta_infinity(bp.cantoid_R_theta, 0.001)
      inclinations = np.linspace(0.0, th_inf - np.pi/2, 30)
      tab = parameter_table(inclinations, bp.cantoid_R_theta, 0.001)
      Rc, R90 = tab['tilde R_c prime'], tab['tilde R_90 prime']
      tab_s = parameter_table(inclinations,
                              bp.Spline_R_theta_from_function(
                                  ngrid=1000,
                                  shape_func=bp.cantoid_R_theta,
                                  shape_func_pars=(0.001,)))
      Rc_s, R90_s = tab_s['tilde R_c prime'], tab_s['tilde R_90 prime']

      result = [['inc', 'R_c', 'R_c spline', 'R_90', 'R_90 spline'], None]
      result += list(zip(np.degrees(inclinations).astype(int),
                         Rc, Rc_s, R90, R90_s))
#+END_SRC

#+RESULTS:
| inc |     R_c | R_c spline |    R_90 | R_90 spline |
|-----+--------+-----------+--------+------------|
|   0 | 1.7894 |    1.7894 | 1.7892 |     1.7892 |
|   2 | 1.8088 |    1.8078 | 1.7899 |     1.7898 |
|   5 | 1.8258 |    1.8258 | 1.7904 |     1.7904 |
|   8 | 1.8432 |    1.8433 | 1.7911 |     1.7911 |
|  10 | 1.8627 |    1.8603 | 1.7921 |     1.7918 |
|  13 | 1.8767 |    1.8796 | 1.7926 |     1.7929 |
|  16 |  1.896 |     1.896 | 1.7937 |     1.7937 |
|  18 | 1.9117 |    1.9078 | 1.7945 |      1.794 |
|  21 | 1.9267 |    1.9222 | 1.7953 |     1.7948 |
|  24 | 1.9409 |    1.9359 | 1.7962 |     1.7955 |
|  26 | 1.9488 |    1.9488 | 1.7963 |     1.7963 |
|  29 | 1.9667 |    1.9608 | 1.7979 |     1.7971 |
|  32 | 1.9719 |    1.9719 |  1.798 |      1.798 |
|  34 |  1.989 |     1.989 |    1.8 |        1.8 |
|  37 | 1.9915 |    1.9915 | 1.8002 |     1.8002 |
|  40 | 2.0076 |    2.0076 | 1.8027 |     1.8027 |
|  43 | 2.0158 |    2.0158 | 1.8045 |     1.8045 |
|  45 | 2.0151 |    2.0151 | 1.8056 |     1.8056 |
|  48 | 2.0307 |    2.0221 | 1.8099 |     1.8086 |
|  51 | 2.0293 |    2.0382 | 1.8127 |      1.814 |
|  53 | 2.0373 |    2.0465 | 1.8184 |     1.8197 |
|  56 | 2.0473 |    2.0473 | 1.8263 |     1.8263 |
|  59 | 2.0707 |    2.0707 |  1.839 |      1.839 |
|  61 | 2.0813 |    2.0813 | 1.8542 |     1.8542 |
|  64 | 2.1136 |    2.1243 | 1.8794 |     1.8809 |
|  67 |  2.169 |    2.1807 | 1.9195 |     1.9211 |
|  69 |  2.288 |    2.2742 | 1.9902 |     1.9886 |
|  72 | 2.5353 |    2.5353 | 2.1268 |     2.1268 |
|  75 | 3.4723 |    3.4723 | 2.4906 |     2.4906 |
|  77 |    nan |       nan |    nan |        nan |

+ So there are two problems here:
  1. The direct function has problems for inc = 1, 2, 3 degrees, while the spline fit is fine there
     - (not apparent any more with this particular list of incs)
     - But we get occasional unbracketed roots errors if we use slightly different lists
  2. The spline fit doesn’t quite get to the asymptotic angle




*** Test ~bow_diagnostic.py~ for the wilkinoid

#+name: test-wilkinoid-diagnostic
#+BEGIN_SRC python :eval yes :return result
  import sys
  import numpy as np
  import bow_projection as bp
  import bow_diagnostic

  bp.N_NEIGHBORHOOD = 50
  bp.DEGREE_POLY_NEIGHBORHOOD = 2
  bp.SCALE_NEIGHBORHOOD = 0.2
  bp.DEGREE_POLY_NEIGHBORHOOD_90 = 2
  bp.SCALE_NEIGHBORHOOD_90 = 0.01

  shape = bp.Spline_R_theta_from_function(ngrid=1000,
                                          shape_func=bp.wilkinoid_R_theta)
  th_inf = bp.theta_infinity(shape)
  inclinations = np.linspace(0.0, th_inf - np.pi/2, 50)
  tab = bow_diagnostic.parameter_table(inclinations, shape)

  result = [tab.colnames, None] + list(tab.as_array())

#+END_SRC

#+RESULTS: test-wilkinoid-diagnostic
| R_0 prime | theta_0 | theta_90 | theta_inf | tilde R_90 prime | tilde R_c prime |  inc |
|----------+--------+---------+----------+-----------------+----------------+------|
|        1 |      0 |      90 |    174.2 |           1.732 |         1.6652 |    0 |
|   1.0003 |    2.9 |      90 |    174.2 |           1.732 |         1.6647 |  1.7 |
|   1.0012 |    5.7 |    90.2 |    174.2 |          1.7319 |         1.6639 |  3.4 |
|   1.0027 |    8.6 |    90.4 |    174.2 |          1.7317 |         1.6631 |  5.2 |
|   1.0048 |   11.5 |    90.6 |    174.2 |          1.7314 |         1.6622 |  6.9 |
|   1.0076 |   14.3 |      91 |    174.2 |           1.731 |         1.6611 |  8.6 |
|   1.0109 |   17.2 |    91.4 |    174.2 |          1.7306 |         1.6599 | 10.3 |
|   1.0149 |   20.1 |      92 |    174.2 |            1.73 |         1.6586 |   12 |
|   1.0196 |     23 |    92.6 |    174.2 |          1.7294 |         1.6568 | 13.8 |
|   1.0249 |   25.9 |    93.2 |    174.2 |          1.7287 |         1.6555 | 15.5 |
|   1.0309 |   28.8 |      94 |    174.2 |           1.728 |         1.6538 | 17.2 |
|   1.0376 |   31.7 |    94.8 |    174.2 |          1.7271 |         1.6521 | 18.9 |
|   1.0451 |   34.6 |    95.7 |    174.2 |          1.7261 |         1.6497 | 20.6 |
|   1.0532 |   37.5 |    96.7 |    174.2 |          1.7251 |         1.6476 | 22.3 |
|   1.0622 |   40.4 |    97.7 |    174.2 |           1.724 |         1.6455 | 24.1 |
|    1.072 |   43.4 |    98.8 |    174.2 |          1.7228 |         1.6439 | 25.8 |
|   1.0826 |   46.3 |     100 |    174.2 |          1.7214 |         1.6409 | 27.5 |
|   1.0941 |   49.3 |   101.2 |    174.2 |          1.7201 |         1.6392 | 29.2 |
|   1.1066 |   52.2 |   102.5 |    174.2 |          1.7186 |         1.6368 | 30.9 |
|   1.1201 |   55.2 |   103.9 |    174.2 |          1.7169 |         1.6334 | 32.7 |
|   1.1347 |   58.2 |   105.3 |    174.2 |          1.7152 |         1.6307 | 34.4 |
|   1.1503 |   61.3 |   106.8 |    174.2 |          1.7134 |         1.6279 | 36.1 |
|   1.1672 |   64.3 |   108.3 |    174.2 |          1.7115 |          1.625 | 37.8 |
|   1.1853 |   67.4 |   109.9 |    174.2 |          1.7095 |          1.622 | 39.5 |
|   1.2047 |   70.4 |   111.6 |    174.2 |          1.7074 |         1.6199 | 41.3 |
|   1.2257 |   73.5 |   113.3 |    174.2 |          1.7051 |         1.6158 |   43 |
|   1.2482 |   76.7 |   115.1 |    174.2 |          1.7029 |         1.6135 | 44.7 |
|   1.2726 |   79.8 |   116.9 |    174.2 |          1.7003 |         1.6091 | 46.4 |
|   1.2987 |     83 |   118.8 |    174.2 |          1.6977 |         1.6056 | 48.1 |
|    1.327 |   86.2 |   120.7 |    174.2 |           1.695 |          1.602 | 49.9 |
|   1.3574 |   89.5 |   122.7 |    174.2 |          1.6922 |         1.5994 | 51.6 |
|   1.3904 |   92.7 |   124.8 |    174.2 |          1.6892 |         1.5955 | 53.3 |
|   1.4261 |   96.1 |   126.8 |    174.2 |          1.6861 |         1.5915 |   55 |
|   1.4651 |   99.4 |     129 |    174.2 |          1.6828 |         1.5863 | 56.7 |
|   1.5075 |  102.8 |   131.2 |    174.2 |          1.6794 |          1.582 | 58.4 |
|   1.5537 |  106.3 |   133.4 |    174.2 |           1.676 |         1.5787 | 60.2 |
|   1.6046 |  109.8 |   135.7 |    174.2 |          1.6722 |          1.573 | 61.9 |
|   1.6606 |  113.4 |   138.1 |    174.2 |          1.6684 |         1.5682 | 63.6 |
|   1.7226 |    117 |   140.5 |    174.2 |          1.6644 |         1.5632 | 65.3 |
|   1.7916 |  120.7 |   142.9 |    174.2 |          1.6603 |         1.5581 |   67 |
|   1.8689 |  124.4 |   145.4 |    174.2 |          1.6562 |         1.5537 | 68.8 |
|   1.9565 |  128.3 |     148 |    174.2 |          1.6518 |         1.5473 | 70.5 |
|   2.0564 |  132.2 |   150.6 |    174.2 |          1.6474 |         1.5416 | 72.2 |
|   2.1718 |  136.3 |   153.2 |    174.2 |           1.643 |         1.5357 | 73.9 |
|   2.3068 |  140.4 |   155.9 |    174.2 |          1.6386 |         1.5305 | 75.6 |
|   2.4683 |  144.7 |   158.7 |    174.2 |           1.634 |         1.5236 | 77.4 |
|   2.6655 |  149.1 |   161.5 |    174.2 |          1.6296 |         1.5175 | 79.1 |
|   2.9142 |  153.6 |   164.3 |    174.2 |          1.6254 |         1.5122 | 80.8 |
|   3.2427 |  158.3 |   167.2 |    174.2 |          1.6214 |         1.5057 | 82.5 |
|   3.7057 |  163.1 |   170.1 |    174.2 |          1.6179 |         1.5009 | 84.2 |


*** Test ~bow_diagnostic.py~ for the cantoids
+ \beta = 0.1 – R_90 starts going up immediately, but R_c drops about 1% and then back again over inc = 0 \to 23 deg. Bow is gone by 37 deg.  Strange reduction in R_c near the end
+ \beta = 0.01 – As for \beta = 0.1 but over 0 \to 37 deg and gone by 63 deg
+ \beta = 0.001 – For inc = 0 \to 45 deg, almost nothing happens. R_c goes down monotonically by about 3%.  R_90 goes down and then up, but only varies by about 0.1%. From 45 \to 60, both go up but only by a few percent. R_c regains its initial value at 66 deg.  Then from 66 \to 75 deg, they go up faster
+ \beta = 0.0001 – This is very similar to the wilkinoid, except for the highest inclinations. Both radii decline until 60–70 deg, but only by 2% for R_90 and 5% for R_c.  Then they start to go up again


#+name: test-cantoid-diagnostic
#+header: :var beta=0.001
#+BEGIN_SRC python :eval yes :return result
  import sys
  import numpy as np
  import bow_projection as bp
  import bow_diagnostic

  bp.N_NEIGHBORHOOD = 50
  bp.DEGREE_POLY_NEIGHBORHOOD = 2
  bp.SCALE_NEIGHBORHOOD = 0.2
  bp.DEGREE_POLY_NEIGHBORHOOD_90 = 2
  bp.SCALE_NEIGHBORHOOD_90 = 0.01

  shape = bp.Spline_R_theta_from_function(ngrid=1000,
                                          shape_func=bp.cantoid_R_theta,
                                          shape_func_pars=(beta,))
  th_inf = bp.theta_infinity(shape)
  inclinations = np.linspace(0.0, th_inf - np.pi/2, 50)
  tab = bow_diagnostic.parameter_table(inclinations, shape)

  result = [tab.colnames, None] + list(tab.as_array())

#+END_SRC

#+RESULTS: test-cantoid-diagnostic
| R_0 prime | theta_0 | theta_90 | theta_inf | tilde R_90 prime | tilde R_c prime |  inc |
|----------+--------+---------+----------+-----------------+----------------+------|
|        1 |      0 |      90 |    165.4 |          1.7884 |         1.7192 |    0 |
|   1.0003 |    2.6 |      90 |    165.4 |          1.7884 |         1.7186 |  1.5 |
|   1.0011 |    5.3 |    90.1 |    165.4 |          1.7884 |         1.7179 |  3.1 |
|   1.0024 |      8 |    90.3 |    165.4 |          1.7883 |         1.7171 |  4.6 |
|   1.0042 |   10.6 |    90.6 |    165.4 |          1.7883 |         1.7163 |  6.2 |
|   1.0066 |   13.3 |    90.9 |    165.4 |          1.7882 |         1.7152 |  7.7 |
|   1.0095 |   15.9 |    91.2 |    165.4 |          1.7881 |         1.7143 |  9.2 |
|    1.013 |   18.6 |    91.7 |    165.4 |          1.7879 |          1.713 | 10.8 |
|    1.017 |   21.2 |    92.2 |    165.4 |          1.7878 |         1.7118 | 12.3 |
|   1.0216 |   23.9 |    92.8 |    165.4 |          1.7877 |         1.7109 | 13.9 |
|   1.0268 |   26.6 |    93.4 |    165.4 |          1.7875 |         1.7091 | 15.4 |
|   1.0325 |   29.3 |    94.1 |    165.4 |          1.7873 |         1.7083 | 16.9 |
|    1.039 |     32 |    94.9 |    165.4 |          1.7871 |         1.7063 | 18.5 |
|    1.046 |   34.7 |    95.8 |    165.4 |           1.787 |         1.7049 |   20 |
|   1.0537 |   37.4 |    96.7 |    165.4 |          1.7868 |         1.7034 | 21.6 |
|   1.0621 |   40.1 |    97.6 |    165.4 |          1.7866 |         1.7018 | 23.1 |
|   1.0712 |   42.8 |    98.6 |    165.4 |          1.7864 |         1.7002 | 24.6 |
|   1.0811 |   45.6 |    99.7 |    165.4 |          1.7863 |         1.6987 | 26.2 |
|   1.0917 |   48.3 |   100.9 |    165.4 |          1.7862 |          1.698 | 27.7 |
|   1.1032 |   51.1 |   102.1 |    165.4 |           1.786 |         1.6955 | 29.3 |
|   1.1154 |   53.8 |   103.3 |    165.4 |           1.786 |         1.6949 | 30.8 |
|   1.1287 |   56.6 |   104.6 |    165.4 |           1.786 |         1.6934 | 32.3 |
|   1.1429 |   59.4 |     106 |    165.4 |          1.7859 |         1.6907 | 33.9 |
|   1.1581 |   62.3 |   107.4 |    165.4 |          1.7861 |         1.6904 | 35.4 |
|   1.1745 |   65.1 |   108.8 |    165.4 |          1.7861 |         1.6877 |   37 |
|    1.192 |     68 |   110.4 |    165.4 |          1.7864 |         1.6863 | 38.5 |
|   1.2107 |   70.8 |   111.9 |    165.4 |          1.7868 |         1.6863 |   40 |
|   1.2309 |   73.7 |   113.6 |    165.4 |          1.7872 |         1.6836 | 41.6 |
|   1.2525 |   76.7 |   115.2 |    165.4 |          1.7879 |         1.6824 | 43.1 |
|   1.2757 |   79.6 |   116.9 |    165.4 |          1.7887 |         1.6813 | 44.6 |
|   1.3006 |   82.6 |   118.7 |    165.4 |          1.7898 |         1.6804 | 46.2 |
|   1.3274 |   85.7 |   120.5 |    165.4 |          1.7912 |         1.6796 | 47.7 |
|   1.3562 |   88.7 |   122.4 |    165.4 |          1.7931 |         1.6807 | 49.3 |
|   1.3873 |   91.8 |   124.3 |    165.4 |          1.7952 |         1.6805 | 50.8 |
|   1.4212 |   94.9 |   126.3 |    165.4 |          1.7977 |         1.6788 | 52.3 |
|   1.4578 |   98.1 |   128.3 |    165.4 |           1.801 |         1.6792 | 53.9 |
|   1.4976 |  101.3 |   130.4 |    165.4 |           1.805 |         1.6801 | 55.4 |
|    1.541 |  104.6 |   132.6 |    165.4 |          1.8102 |         1.6834 |   57 |
|   1.5886 |    108 |   134.7 |    165.4 |          1.8164 |         1.6856 | 58.5 |
|   1.6411 |  111.4 |     137 |    165.4 |          1.8242 |         1.6888 |   60 |
|   1.6992 |  114.9 |   139.3 |    165.4 |          1.8339 |         1.6932 | 61.6 |
|   1.7642 |  118.5 |   141.7 |    165.4 |          1.8461 |         1.6972 | 63.1 |
|    1.837 |  122.1 |   144.1 |    165.4 |          1.8619 |         1.7052 | 64.7 |
|   1.9197 |  125.9 |   146.6 |    165.4 |          1.8826 |         1.7162 | 66.2 |
|   2.0147 |  129.8 |   149.1 |    165.4 |          1.9101 |         1.7314 | 67.7 |
|   2.1254 |  133.9 |   151.7 |    165.4 |          1.9481 |         1.7552 | 69.3 |
|    2.258 |  138.2 |   154.4 |    165.4 |          2.0019 |         1.7834 | 70.8 |
|   2.4205 |  142.7 |   157.2 |    165.4 |          2.0842 |         1.8334 | 72.4 |
|   2.6299 |  147.6 |   160.1 |    165.4 |           2.221 |           1.91 | 73.9 |
|   2.9224 |    153 |     163 |    165.4 |          2.4926 |         2.0492 | 75.4 |


#+call: test-cantoid-diagnostic(beta=0.1)

#+RESULTS:
| R_0 prime | theta_0 | theta_90 | theta_inf | tilde R_90 prime | tilde R_c prime |  inc |
|----------+--------+---------+----------+-----------------+----------------+------|
|        1 |      0 |      90 |    127.6 |          2.5087 |         2.4246 |    0 |
|   1.0002 |    1.9 |      90 |    127.6 |          2.5089 |         2.4219 |  0.8 |
|   1.0006 |    3.7 |    90.1 |    127.6 |          2.5095 |          2.419 |  1.5 |
|   1.0012 |    5.6 |    90.1 |    127.6 |          2.5105 |         2.4165 |  2.3 |
|   1.0021 |    7.5 |    90.3 |    127.6 |           2.512 |         2.4141 |  3.1 |
|   1.0033 |    9.4 |    90.4 |    127.6 |          2.5139 |         2.4119 |  3.8 |
|   1.0048 |   11.2 |    90.6 |    127.6 |          2.5163 |         2.4111 |  4.6 |
|   1.0065 |   13.1 |    90.8 |    127.6 |          2.5191 |          2.408 |  5.4 |
|   1.0085 |     15 |      91 |    127.6 |          2.5225 |         2.4079 |  6.1 |
|   1.0108 |   16.9 |    91.3 |    127.6 |          2.5263 |         2.4066 |  6.9 |
|   1.0133 |   18.8 |    91.6 |    127.6 |          2.5306 |         2.4055 |  7.7 |
|   1.0162 |   20.7 |    91.9 |    127.6 |          2.5353 |         2.4021 |  8.4 |
|   1.0193 |   22.6 |    92.3 |    127.6 |          2.5407 |         2.4039 |  9.2 |
|   1.0228 |   24.5 |    92.7 |    127.6 |          2.5465 |         2.4003 |   10 |
|   1.0266 |   26.4 |    93.1 |    127.6 |           2.553 |         2.3996 | 10.7 |
|   1.0306 |   28.3 |    93.6 |    127.6 |          2.5601 |         2.3992 | 11.5 |
|    1.035 |   30.3 |      94 |    127.6 |          2.5679 |         2.3989 | 12.3 |
|   1.0397 |   32.2 |    94.6 |    127.6 |          2.5765 |         2.4037 | 13.1 |
|   1.0448 |   34.2 |    95.1 |    127.6 |          2.5858 |         2.4043 | 13.8 |
|   1.0503 |   36.1 |    95.7 |    127.6 |          2.5956 |         2.3996 | 14.6 |
|   1.0561 |   38.1 |    96.3 |    127.6 |          2.6064 |         2.4002 | 15.4 |
|   1.0624 |   40.1 |    96.9 |    127.6 |          2.6182 |         2.4011 | 16.1 |
|   1.0688 |   42.1 |    97.6 |    127.6 |          2.6313 |         2.4096 | 16.9 |
|    1.076 |   44.1 |    98.3 |    127.6 |          2.6448 |         2.4037 | 17.7 |
|   1.0834 |   46.1 |      99 |    127.6 |          2.6603 |         2.4139 | 18.4 |
|   1.0915 |   48.2 |    99.7 |    127.6 |          2.6761 |         2.4072 | 19.2 |
|      1.1 |   50.2 |   100.5 |    127.6 |          2.6939 |         2.4093 |   20 |
|    1.109 |   52.3 |   101.3 |    127.6 |          2.7131 |         2.4116 | 20.7 |
|   1.1186 |   54.4 |   102.2 |    127.6 |          2.7341 |         2.4141 | 21.5 |
|   1.1285 |   56.5 |     103 |    127.6 |          2.7578 |         2.4293 | 22.3 |
|   1.1396 |   58.7 |   103.9 |    127.6 |          2.7821 |         2.4195 |   23 |
|   1.1507 |   60.9 |   104.9 |    127.6 |          2.8105 |          2.437 | 23.8 |
|   1.1629 |   63.1 |   105.8 |    127.6 |          2.8408 |          2.441 | 24.6 |
|   1.1764 |   65.3 |   106.8 |    127.6 |          2.8732 |         2.4274 | 25.3 |
|   1.1899 |   67.6 |   107.8 |    127.6 |          2.9114 |         2.4484 | 26.1 |
|   1.2048 |   69.9 |   108.8 |    127.6 |          2.9527 |         2.4514 | 26.9 |
|   1.2214 |   72.3 |   109.9 |    127.6 |          2.9974 |          2.431 | 27.6 |
|   1.2386 |   74.7 |     111 |    127.6 |          3.0492 |         2.4295 | 28.4 |
|   1.2563 |   77.1 |   112.1 |    127.6 |          3.1101 |         2.4526 | 29.2 |
|   1.2773 |   79.6 |   113.3 |    127.6 |          3.1751 |         2.4176 | 29.9 |
|   1.2981 |   82.2 |   114.5 |    127.6 |          3.2554 |         2.4374 | 30.7 |
|   1.3233 |   84.9 |   115.7 |    127.6 |           3.343 |         2.3824 | 31.5 |
|   1.3483 |   87.7 |   116.9 |    127.6 |          3.4539 |         2.3893 | 32.2 |
|   1.3778 |   90.6 |   118.2 |    127.6 |          3.5833 |         2.3406 |   33 |
|   1.4112 |   93.6 |   119.5 |    127.6 |          3.7423 |         2.2625 | 33.8 |
|   1.4534 |   96.8 |   120.8 |    127.6 |          3.9338 |         2.0801 | 34.5 |
|   1.4977 |  100.2 |   122.2 |    127.6 |          4.2028 |         1.9343 | 35.3 |
|   1.5614 |    104 |   123.6 |    127.6 |          4.5519 |         1.6066 | 36.1 |
|   1.6703 |  108.2 |     125 |    127.6 |          5.0121 |         1.0941 | 36.9 |
|   2.1507 |  113.1 |   126.5 |    127.6 |          4.9983 |         0.4141 | 37.6 |

#+call: test-cantoid-diagnostic(beta=0.01)

#+RESULTS:
| R_0 prime | theta_0 | theta_90 | theta_inf | tilde R_90 prime | tilde R_c prime |  inc |
|----------+--------+---------+----------+-----------------+----------------+------|
|        1 |      0 |      90 |    152.7 |          1.9226 |         1.8488 |    0 |
|   1.0002 |    2.4 |      90 |    152.7 |          1.9226 |         1.8479 |  1.3 |
|   1.0009 |    4.7 |    90.1 |    152.7 |          1.9227 |         1.8471 |  2.6 |
|   1.0019 |    7.1 |    90.3 |    152.7 |          1.9229 |         1.8462 |  3.8 |
|   1.0034 |    9.5 |    90.4 |    152.7 |          1.9233 |         1.8453 |  5.1 |
|   1.0054 |   11.9 |    90.7 |    152.7 |          1.9237 |         1.8447 |  6.4 |
|   1.0078 |   14.2 |      91 |    152.7 |          1.9242 |         1.8439 |  7.7 |
|   1.0106 |   16.6 |    91.4 |    152.7 |          1.9248 |          1.843 |    9 |
|   1.0139 |     19 |    91.8 |    152.7 |          1.9255 |         1.8418 | 10.2 |
|   1.0176 |   21.4 |    92.2 |    152.7 |          1.9263 |         1.8409 | 11.5 |
|   1.0218 |   23.8 |    92.8 |    152.7 |          1.9273 |         1.8401 | 12.8 |
|   1.0265 |   26.2 |    93.3 |    152.7 |          1.9284 |           1.84 | 14.1 |
|   1.0317 |   28.6 |      94 |    152.7 |          1.9296 |         1.8394 | 15.4 |
|   1.0374 |     31 |    94.6 |    152.7 |          1.9309 |         1.8378 | 16.6 |
|   1.0436 |   33.4 |    95.4 |    152.7 |          1.9324 |         1.8382 | 17.9 |
|   1.0504 |   35.8 |    96.1 |    152.7 |           1.934 |         1.8366 | 19.2 |
|   1.0577 |   38.3 |      97 |    152.7 |          1.9359 |         1.8374 | 20.5 |
|   1.0656 |   40.7 |    97.9 |    152.7 |          1.9379 |         1.8371 | 21.7 |
|   1.0741 |   43.2 |    98.8 |    152.7 |          1.9402 |          1.837 |   23 |
|   1.0833 |   45.7 |    99.8 |    152.7 |          1.9425 |         1.8354 | 24.3 |
|   1.0931 |   48.1 |   100.8 |    152.7 |          1.9453 |         1.8371 | 25.6 |
|   1.1037 |   50.6 |   101.8 |    152.7 |          1.9482 |         1.8356 | 26.9 |
|   1.1149 |   53.1 |     103 |    152.7 |          1.9516 |         1.8378 | 28.1 |
|   1.1269 |   55.7 |   104.1 |    152.7 |          1.9552 |         1.8385 | 29.4 |
|   1.1399 |   58.2 |   105.3 |    152.7 |           1.959 |         1.8372 | 30.7 |
|   1.1536 |   60.8 |   106.6 |    152.7 |          1.9634 |         1.8382 |   32 |
|   1.1682 |   63.4 |   107.9 |    152.7 |          1.9684 |         1.8419 | 33.3 |
|    1.184 |     66 |   109.2 |    152.7 |          1.9736 |         1.8411 | 34.5 |
|   1.2007 |   68.6 |   110.6 |    152.7 |          1.9796 |         1.8431 | 35.8 |
|   1.2185 |   71.2 |   112.1 |    152.7 |          1.9865 |         1.8484 | 37.1 |
|   1.2376 |   73.9 |   113.5 |    152.7 |          1.9939 |         1.8514 | 38.4 |
|   1.2581 |   76.6 |   115.1 |    152.7 |          2.0022 |         1.8549 | 39.7 |
|     1.28 |   79.4 |   116.6 |    152.7 |          2.0116 |         1.8591 | 40.9 |
|   1.3036 |   82.1 |   118.3 |    152.7 |          2.0221 |          1.864 | 42.2 |
|   1.3291 |     85 |   119.9 |    152.7 |          2.0338 |          1.866 | 43.5 |
|   1.3562 |   87.8 |   121.6 |    152.7 |          2.0477 |         1.8764 | 44.8 |
|   1.3859 |   90.7 |   123.4 |    152.7 |          2.0629 |         1.8801 | 46.1 |
|   1.4178 |   93.7 |   125.2 |    152.7 |          2.0808 |          1.889 | 47.3 |
|   1.4522 |   96.7 |     127 |    152.7 |          2.1021 |         1.9041 | 48.6 |
|   1.4904 |   99.8 |   128.9 |    152.7 |          2.1262 |         1.9118 | 49.9 |
|   1.5316 |  102.9 |   130.9 |    152.7 |          2.1556 |         1.9319 | 51.2 |
|   1.5773 |  106.2 |   132.9 |    152.7 |          2.1905 |         1.9499 | 52.5 |
|   1.6285 |  109.5 |   134.9 |    152.7 |          2.2324 |         1.9653 | 53.7 |
|   1.6851 |    113 |     137 |    152.7 |          2.2858 |         1.9981 |   55 |
|   1.7495 |  116.6 |   139.2 |    152.7 |           2.353 |         2.0306 | 56.3 |
|   1.8236 |  120.4 |   141.4 |    152.7 |          2.4414 |         2.0709 | 57.6 |
|   1.9104 |  124.4 |   143.7 |    152.7 |          2.5628 |          2.121 | 58.8 |
|   2.0152 |  128.7 |     146 |    152.7 |          2.7404 |          2.181 | 60.1 |
|   2.1495 |  133.5 |   148.4 |    152.7 |          3.0259 |         2.2153 | 61.4 |
|   2.3352 |  139.1 |   150.9 |    152.7 |          3.5901 |         2.1653 | 62.7 |

#+call: test-cantoid-diagnostic(beta=0.0001)

#+RESULTS:
| R_0 prime | theta_0 | theta_90 | theta_inf | tilde R_90 prime | tilde R_c prime |  inc |
|----------+--------+---------+----------+-----------------+----------------+------|
|        1 |      0 |      90 |    171.1 |          1.7495 |         1.6819 |    0 |
|   1.0003 |    2.8 |      90 |    171.1 |          1.7495 |         1.6814 |  1.7 |
|   1.0012 |    5.6 |    90.2 |    171.1 |          1.7494 |         1.6807 |  3.3 |
|   1.0026 |    8.4 |    90.3 |    171.1 |          1.7492 |         1.6798 |    5 |
|   1.0046 |   11.1 |    90.6 |    171.1 |           1.749 |          1.679 |  6.6 |
|   1.0072 |   13.9 |      91 |    171.1 |          1.7488 |         1.6778 |  8.3 |
|   1.0104 |   16.7 |    91.4 |    171.1 |          1.7484 |         1.6766 |  9.9 |
|   1.0142 |   19.5 |    91.9 |    171.1 |           1.748 |         1.6753 | 11.6 |
|   1.0186 |   22.3 |    92.4 |    171.1 |          1.7476 |         1.6742 | 13.2 |
|   1.0236 |   25.1 |    93.1 |    171.1 |          1.7471 |         1.6728 | 14.9 |
|   1.0293 |     28 |    93.8 |    171.1 |          1.7465 |         1.6708 | 16.5 |
|   1.0357 |   30.8 |    94.6 |    171.1 |          1.7459 |         1.6692 | 18.2 |
|   1.0427 |   33.6 |    95.4 |    171.1 |          1.7452 |         1.6679 | 19.9 |
|   1.0505 |   36.4 |    96.3 |    171.1 |          1.7444 |         1.6656 | 21.5 |
|   1.0589 |   39.3 |    97.3 |    171.1 |          1.7437 |         1.6643 | 23.2 |
|   1.0682 |   42.1 |    98.4 |    171.1 |          1.7428 |         1.6623 | 24.8 |
|   1.0782 |     45 |    99.5 |    171.1 |          1.7419 |         1.6603 | 26.5 |
|   1.0891 |   47.9 |   100.7 |    171.1 |          1.7409 |         1.6582 | 28.1 |
|   1.1009 |   50.8 |   101.9 |    171.1 |          1.7399 |         1.6561 | 29.8 |
|   1.1136 |   53.7 |   103.2 |    171.1 |          1.7388 |         1.6539 | 31.4 |
|   1.1273 |   56.6 |   104.6 |    171.1 |          1.7377 |         1.6517 | 33.1 |
|    1.142 |   59.5 |     106 |    171.1 |          1.7365 |         1.6493 | 34.7 |
|   1.1578 |   62.5 |   107.5 |    171.1 |          1.7352 |          1.646 | 36.4 |
|   1.1748 |   65.5 |     109 |    171.1 |          1.7339 |         1.6435 | 38.1 |
|   1.1931 |   68.5 |   110.6 |    171.1 |          1.7326 |          1.641 | 39.7 |
|   1.2126 |   71.5 |   112.2 |    171.1 |          1.7313 |         1.6396 | 41.4 |
|   1.2338 |   74.5 |   113.9 |    171.1 |          1.7298 |         1.6359 |   43 |
|   1.2563 |   77.6 |   115.7 |    171.1 |          1.7285 |         1.6344 | 44.7 |
|   1.2808 |   80.7 |   117.5 |    171.1 |           1.727 |         1.6306 | 46.3 |
|    1.307 |   83.8 |   119.3 |    171.1 |          1.7255 |         1.6279 |   48 |
|   1.3353 |   86.9 |   121.2 |    171.1 |          1.7241 |         1.6252 | 49.6 |
|   1.3657 |   90.1 |   123.2 |    171.1 |          1.7228 |         1.6237 | 51.3 |
|   1.3988 |   93.3 |   125.2 |    171.1 |          1.7213 |         1.6198 | 52.9 |
|   1.4345 |   96.6 |   127.3 |    171.1 |          1.7201 |         1.6183 | 54.6 |
|   1.4735 |   99.9 |   129.4 |    171.1 |          1.7188 |         1.6144 | 56.3 |
|   1.5158 |  103.2 |   131.5 |    171.1 |          1.7179 |         1.6131 | 57.9 |
|   1.5621 |  106.6 |   133.8 |    171.1 |          1.7171 |         1.6105 | 59.6 |
|   1.6129 |  110.1 |     136 |    171.1 |          1.7165 |         1.6081 | 61.2 |
|   1.6691 |  113.6 |   138.4 |    171.1 |          1.7162 |         1.6046 | 62.9 |
|   1.7313 |  117.2 |   140.7 |    171.1 |          1.7166 |         1.6027 | 64.5 |
|   1.8005 |  120.9 |   143.2 |    171.1 |          1.7179 |         1.6024 | 66.2 |
|   1.8784 |  124.6 |   145.7 |    171.1 |            1.72 |         1.6014 | 67.8 |
|   1.9668 |  128.5 |   148.2 |    171.1 |          1.7234 |         1.6012 | 69.5 |
|   2.0681 |  132.4 |   150.8 |    171.1 |          1.7289 |         1.6023 | 71.1 |
|   2.1861 |  136.5 |   153.5 |    171.1 |          1.7371 |         1.6038 | 72.8 |
|   2.3252 |  140.7 |   156.2 |    171.1 |          1.7498 |         1.6105 | 74.5 |
|   2.4939 |    145 |   159.1 |    171.1 |          1.7694 |         1.6205 | 76.1 |
|   2.7047 |  149.6 |   161.9 |    171.1 |          1.8008 |         1.6367 | 77.8 |
|   2.9805 |  154.4 |   164.9 |    171.1 |          1.8552 |         1.6687 | 79.4 |
|   3.3697 |  159.5 |   167.9 |    171.1 |          1.9632 |         1.7355 | 81.1 |


*** Test ~bow_diagnostic.py~ for the dragoids
+ Something strange is going on with these
+ R_0’ is fine and R_90’ is mostly fine too, but R_c’ is all over the place, especially for low inclinations
+ This turned out to be because of the small value of ~bp.SCALE_NEIGHBORHOOD~, which meant it was trying to fit small fluctuations in the radius close to the axis
  + These are really there in the data, and must be due to the discretization in the impact parameter of the drag models
+ So, if I use ~bp.SCALE_NEIGHBORHOOD = 0.2~, which corresponds to 36 degrees, then things are much better
+ Results are:
  + R_c increases slightly at constant R_90 for i = 0 \to 20 deg, but this is hardly noticeable: for instance, 1.89 \to 1.92 for \alpha_drag = 0.25
  + Then R_c goes back again, and then keeps on decreasing, while R_90 starts decreasing also, maintaining R_90 \approx 1.03 R_c
#+name: test-dragoid-diagnostic
#+header: :var alpha=0.25 mu=0
#+BEGIN_SRC python :eval yes :return result
  import sys
  import numpy as np
  import bow_projection as bp
  import dragoid_shape
  import bow_diagnostic

  bp.N_NEIGHBORHOOD = 50
  bp.DEGREE_POLY_NEIGHBORHOOD = 2
  bp.SCALE_NEIGHBORHOOD = 0.2
  bp.DEGREE_POLY_NEIGHBORHOOD_90 = 2
  bp.SCALE_NEIGHBORHOOD_90 = 0.01

  shape = dragoid_shape.Dragoid(alpha=alpha, mu=None if mu == 0 else mu)

  th_inf = bp.theta_infinity(shape)
  inclinations = np.linspace(0.0, th_inf - np.pi/2, 50)
  tab = bow_diagnostic.parameter_table(inclinations, shape)

  result = [tab.colnames, None] + list(tab.as_array())

#+END_SRC

#+RESULTS: test-dragoid-diagnostic
| R_0 prime | theta_0 | theta_90 | theta_inf | tilde R_90 prime | tilde R_c prime |  inc |
|----------+--------+---------+----------+-----------------+----------------+------|
|   0.9999 |      0 |      90 |    163.3 |          1.9583 |           1.89 |    0 |
|   1.0001 |    3.9 |      90 |    163.3 |          1.9586 |         1.9048 |  1.5 |
|   1.0008 |    6.5 |    90.1 |    163.3 |          1.9591 |         1.9221 |    3 |
|   1.0023 |   11.2 |    90.3 |    163.3 |          1.9591 |         1.9228 |  4.5 |
|   1.0045 |    9.3 |    90.6 |    163.3 |          1.9592 |         1.9299 |    6 |
|   1.0073 |   11.6 |    90.9 |    163.3 |          1.9594 |         1.9354 |  7.5 |
|   1.0109 |   16.1 |    91.4 |    163.3 |          1.9593 |          1.929 |    9 |
|   1.0152 |   20.3 |    91.8 |    163.3 |          1.9594 |         1.9257 | 10.5 |
|   1.0202 |   23.5 |    92.3 |    163.3 |           1.959 |         1.9235 |   12 |
|   1.0259 |   26.4 |      93 |    163.3 |          1.9587 |         1.9237 | 13.5 |
|   1.0323 |   28.6 |    93.7 |    163.3 |          1.9586 |         1.9222 |   15 |
|   1.0395 |     32 |    94.4 |    163.3 |          1.9583 |         1.9226 | 16.4 |
|   1.0475 |   35.4 |    95.3 |    163.3 |          1.9577 |         1.9199 | 17.9 |
|   1.0561 |   37.4 |    96.2 |    163.3 |          1.9583 |         1.9244 | 19.4 |
|   1.0658 |   40.3 |      97 |    163.3 |          1.9578 |         1.9242 | 20.9 |
|   1.0765 |   43.8 |    98.1 |    163.3 |          1.9569 |         1.9133 | 22.4 |
|   1.0879 |   47.3 |    99.1 |    163.3 |          1.9562 |         1.9154 | 23.9 |
|   1.1002 |   49.6 |   100.2 |    163.3 |          1.9557 |         1.9172 | 25.4 |
|   1.1136 |   52.1 |   101.5 |    163.3 |          1.9552 |         1.9196 | 26.9 |
|   1.1284 |   55.5 |   102.6 |    163.3 |           1.954 |         1.9118 | 28.4 |
|   1.1441 |   58.2 |     104 |    163.3 |          1.9533 |         1.9105 | 29.9 |
|   1.1615 |     62 |   105.4 |    163.3 |          1.9516 |         1.8947 | 31.4 |
|   1.1793 |   64.5 |   106.5 |    163.3 |          1.9518 |         1.8993 | 32.9 |
|   1.1988 |   66.6 |     108 |    163.3 |          1.9509 |         1.9008 | 34.4 |
|   1.2198 |     70 |   109.7 |    163.3 |          1.9488 |         1.8953 | 35.9 |
|   1.2423 |   73.1 |   110.8 |    163.3 |          1.9475 |          1.894 | 37.4 |
|   1.2665 |     75 |   112.4 |    163.3 |          1.9457 |         1.8949 | 38.9 |
|   1.2922 |   77.6 |     114 |    163.3 |          1.9446 |         1.8972 | 40.4 |
|   1.3209 |   82.6 |   115.7 |    163.3 |          1.9417 |         1.8793 | 41.9 |
|   1.3514 |   85.3 |   117.1 |    163.3 |          1.9392 |         1.8702 | 43.4 |
|   1.3827 |   87.3 |   118.9 |    163.3 |          1.9383 |         1.8876 | 44.9 |
|   1.4182 |   90.2 |   120.5 |    163.3 |          1.9349 |         1.8711 | 46.4 |
|   1.4555 |   93.8 |   122.2 |    163.3 |           1.933 |         1.8727 | 47.8 |
|   1.4963 |   96.4 |   123.9 |    163.3 |          1.9297 |         1.8697 | 49.3 |
|   1.5402 |   99.5 |   125.7 |    163.3 |          1.9263 |         1.8647 | 50.8 |
|   1.5879 |  102.3 |   127.5 |    163.3 |          1.9225 |         1.8542 | 52.3 |
|   1.6402 |  106.1 |   129.4 |    163.3 |          1.9174 |         1.8383 | 53.8 |
|   1.6953 |  107.9 |   131.1 |    163.3 |           1.914 |         1.8462 | 55.3 |
|   1.7555 |  110.4 |     133 |    163.3 |          1.9099 |          1.849 | 56.8 |
|   1.8219 |  113.9 |   134.8 |    163.3 |          1.9046 |         1.8405 | 58.3 |
|   1.8947 |  116.8 |   136.7 |    163.3 |          1.8989 |         1.8343 | 59.8 |
|   1.9743 |  119.6 |   138.6 |    163.3 |           1.892 |         1.8285 | 61.3 |
|   2.0618 |  122.3 |   140.4 |    163.3 |          1.8845 |         1.8229 | 62.8 |
|   2.1587 |  125.3 |   142.3 |    163.3 |          1.8762 |         1.8127 | 64.3 |
|   2.2657 |    128 |   144.3 |    163.3 |           1.867 |         1.8063 | 65.8 |
|   2.3856 |  131.1 |   146.2 |    163.3 |          1.8561 |          1.794 | 67.3 |
|   2.5192 |  133.8 |   148.1 |    163.3 |           1.844 |         1.7834 | 68.8 |
|   2.6708 |  136.8 |     150 |    163.3 |          1.8293 |         1.7603 | 70.3 |
|   2.8384 |  139.4 |     152 |    163.3 |           1.815 |         1.7601 | 71.8 |
|   3.0316 |  142.3 |   153.9 |    163.3 |          1.7967 |         1.7417 | 73.3 |

#+call: test-dragoid-diagnostic(alpha=0.5)

#+RESULTS:
| R_0 prime | theta_0 | theta_90 | theta_inf | tilde R_90 prime | tilde R_c prime |  inc |
|----------+--------+---------+----------+-----------------+----------------+------|
|   0.9999 |      0 |      90 |    168.7 |          1.9188 |         1.8572 |    0 |
|   1.0002 |    5.6 |      90 |    168.7 |           1.919 |         1.8679 |  1.6 |
|   1.0011 |      6 |    90.2 |    168.7 |          1.9191 |         1.8723 |  3.2 |
|   1.0027 |    7.6 |    90.4 |    168.7 |          1.9191 |         1.8795 |  4.8 |
|   1.0051 |   10.5 |    90.7 |    168.7 |           1.919 |         1.8834 |  6.4 |
|   1.0083 |     14 |      91 |    168.7 |          1.9187 |          1.885 |    8 |
|   1.0122 |   17.5 |    91.5 |    168.7 |          1.9184 |         1.8864 |  9.6 |
|   1.0169 |   20.9 |      92 |    168.7 |           1.918 |         1.8848 | 11.2 |
|   1.0223 |   23.8 |    92.6 |    168.7 |          1.9175 |         1.8883 | 12.8 |
|   1.0285 |   26.7 |    93.3 |    168.7 |          1.9168 |         1.8918 | 14.5 |
|   1.0358 |     32 |    94.1 |    168.7 |           1.916 |         1.8855 | 16.1 |
|   1.0437 |   34.1 |    94.9 |    168.7 |          1.9155 |         1.8876 | 17.7 |
|   1.0526 |   36.8 |    95.7 |    168.7 |          1.9143 |         1.8839 | 19.3 |
|   1.0624 |   39.5 |    96.9 |    168.7 |          1.9133 |         1.8814 | 20.9 |
|   1.0731 |   42.8 |    97.7 |    168.7 |          1.9124 |          1.882 | 22.5 |
|   1.0852 |   47.3 |    98.8 |    168.7 |          1.9096 |         1.8667 | 24.1 |
|    1.098 |   49.7 |   100.1 |    168.7 |           1.908 |         1.8674 | 25.7 |
|   1.1115 |   51.7 |   101.3 |    168.7 |          1.9071 |         1.8753 | 27.3 |
|   1.1266 |   55.6 |   102.5 |    168.7 |          1.9048 |         1.8707 | 28.9 |
|   1.1431 |   58.4 |   103.9 |    168.7 |          1.9028 |          1.865 | 30.5 |
|   1.1606 |   60.6 |   105.2 |    168.7 |          1.9004 |         1.8638 | 32.1 |
|   1.1797 |   64.3 |   106.5 |    168.7 |          1.8974 |          1.855 | 33.7 |
|   1.2003 |   67.5 |   108.4 |    168.7 |          1.8955 |         1.8468 | 35.3 |
|   1.2226 |     71 |   109.2 |    168.7 |          1.8915 |         1.8368 | 36.9 |
|   1.2454 |   72.5 |   111.3 |    168.7 |          1.8891 |         1.8543 | 38.5 |
|   1.2717 |   77.3 |   112.8 |    168.7 |           1.884 |         1.8311 | 40.1 |
|   1.2984 |   79.2 |   114.3 |    168.7 |          1.8812 |          1.841 | 41.8 |
|   1.3282 |   82.8 |   116.2 |    168.7 |          1.8765 |         1.8308 | 43.4 |
|   1.3607 |   85.4 |   117.8 |    168.7 |          1.8709 |         1.8161 |   45 |
|   1.3944 |   88.1 |   119.5 |    168.7 |          1.8663 |         1.8175 | 46.6 |
|   1.4313 |   91.8 |   121.3 |    168.7 |          1.8607 |         1.8076 | 48.2 |
|   1.4711 |   95.1 |   123.2 |    168.7 |          1.8549 |         1.8051 | 49.8 |
|   1.5141 |   97.6 |   124.9 |    168.7 |          1.8479 |          1.801 | 51.4 |
|   1.5609 |  101.3 |   126.8 |    168.7 |          1.8403 |         1.7873 |   53 |
|   1.6112 |  103.9 |   128.6 |    168.7 |          1.8325 |         1.7806 | 54.6 |
|   1.6678 |  108.1 |   130.4 |    168.7 |          1.8213 |         1.7511 | 56.2 |
|   1.7245 |    109 |   132.2 |    168.7 |          1.8146 |         1.7747 | 57.8 |
|   1.7896 |  112.8 |   134.2 |    168.7 |          1.8032 |         1.7558 | 59.4 |
|   1.8608 |  116.1 |   136.1 |    168.7 |          1.7908 |         1.7367 |   61 |
|   1.9371 |  118.5 |     138 |    168.7 |          1.7788 |         1.7314 | 62.6 |
|   2.0212 |  121.5 |   139.8 |    168.7 |          1.7644 |         1.7193 | 64.2 |
|   2.1132 |  123.9 |   141.9 |    168.7 |          1.7491 |          1.711 | 65.8 |
|   2.2158 |  127.2 |   143.8 |    168.7 |           1.731 |         1.6889 | 67.4 |
|   2.3289 |  130.4 |   145.8 |    168.7 |          1.7112 |         1.6664 | 69.1 |
|   2.4533 |  133.1 |   147.7 |    168.7 |          1.6899 |         1.6506 | 70.7 |
|   2.5925 |    136 |   149.7 |    168.7 |          1.6658 |         1.6263 | 72.3 |
|   2.7479 |  138.7 |   151.7 |    168.7 |          1.6389 |          1.601 | 73.9 |
|   2.9228 |  141.7 |   153.7 |    168.7 |          1.6086 |         1.5695 | 75.5 |
|   3.1194 |  144.4 |   155.6 |    168.7 |          1.5749 |         1.5372 | 77.1 |
|   3.3429 |  147.3 |   157.6 |    168.7 |           1.537 |         1.5002 | 78.7 |


#+call: test-dragoid-diagnostic(alpha=1.0)

#+RESULTS:
| R_0 prime | theta_0 | theta_90 | theta_inf | tilde R_90 prime | tilde R_c prime |  inc |
|----------+--------+---------+----------+-----------------+----------------+------|
|        1 |      0 |      90 |    174.1 |          1.8309 |         1.7709 |    0 |
|   1.0003 |    3.3 |      90 |    174.1 |          1.8308 |         1.7735 |  1.7 |
|   1.0012 |      7 |    90.2 |    174.1 |          1.8309 |         1.7872 |  3.4 |
|   1.0029 |    8.2 |    90.4 |    174.1 |          1.8308 |         1.7967 |  5.2 |
|   1.0054 |   12.4 |    90.7 |    174.1 |          1.8302 |         1.7976 |  6.9 |
|   1.0088 |   15.9 |    91.1 |    174.1 |          1.8294 |         1.7938 |  8.6 |
|   1.0128 |   18.8 |    91.5 |    174.1 |          1.8284 |         1.7909 | 10.3 |
|   1.0175 |   21.1 |    92.1 |    174.1 |          1.8275 |         1.7965 |   12 |
|    1.023 |   24.6 |    92.7 |    174.1 |          1.8263 |         1.8011 | 13.7 |
|   1.0295 |   27.8 |    93.5 |    174.1 |          1.8248 |          1.801 | 15.5 |
|   1.0369 |   31.1 |    94.3 |    174.1 |          1.8233 |          1.794 | 17.2 |
|   1.0451 |   34.7 |      95 |    174.1 |          1.8211 |         1.7905 | 18.9 |
|   1.0541 |   37.2 |    96.1 |    174.1 |          1.8188 |          1.791 | 20.6 |
|   1.0641 |   41.3 |    97.1 |    174.1 |          1.8169 |         1.7864 | 22.3 |
|    1.075 |     42 |      98 |    174.1 |          1.8142 |         1.7847 |   24 |
|   1.0873 |   46.5 |    99.3 |    174.1 |            1.81 |         1.7742 | 25.8 |
|   1.1003 |     50 |   100.3 |    174.1 |          1.8069 |         1.7704 | 27.5 |
|    1.114 |   54.6 |   101.7 |    174.1 |          1.8038 |         1.7723 | 29.2 |
|   1.1295 |   55.3 |   102.9 |    174.1 |          1.7997 |         1.7664 | 30.9 |
|    1.146 |   57.6 |   104.4 |    174.1 |          1.7954 |         1.7639 | 32.6 |
|   1.1637 |   62.8 |   105.5 |    174.1 |          1.7908 |         1.7602 | 34.3 |
|   1.1839 |   67.2 |   107.3 |    174.1 |          1.7842 |         1.7357 | 36.1 |
|   1.2041 |   67.5 |   108.6 |    174.1 |          1.7791 |         1.7405 | 37.8 |
|   1.2261 |     71 |   110.4 |    174.1 |          1.7751 |         1.7391 | 39.5 |
|   1.2502 |   74.5 |   111.4 |    174.1 |          1.7679 |         1.7273 | 41.2 |
|   1.2757 |   77.9 |   113.5 |    174.1 |          1.7601 |         1.7203 | 42.9 |
|   1.3024 |   80.9 |   115.2 |    174.1 |          1.7536 |         1.7252 | 44.6 |
|   1.3339 |   86.2 |   116.7 |    174.1 |          1.7426 |         1.6916 | 46.4 |
|   1.3651 |   88.2 |   118.4 |    174.1 |          1.7347 |         1.6906 | 48.1 |
|   1.3985 |   89.1 |   120.3 |    174.1 |          1.7259 |         1.6912 | 49.8 |
|    1.435 |   92.7 |   121.8 |    174.1 |          1.7161 |         1.6803 | 51.5 |
|   1.4744 |     95 |   123.9 |    174.1 |          1.7051 |         1.6638 | 53.2 |
|   1.5161 |     98 |   125.6 |    174.1 |          1.6938 |         1.6606 | 54.9 |
|   1.5617 |  102.2 |   127.2 |    174.1 |          1.6813 |         1.6449 | 56.7 |
|   1.6105 |  104.9 |   129.3 |    174.1 |          1.6673 |         1.6309 | 58.4 |
|   1.6654 |  109.7 |   131.3 |    174.1 |          1.6507 |         1.5969 | 60.1 |
|    1.721 |  110.8 |   133.2 |    174.1 |          1.6361 |         1.5907 | 61.8 |
|   1.7817 |  113.7 |   135.2 |    174.1 |          1.6199 |         1.5806 | 63.5 |
|   1.8477 |  116.2 |     137 |    174.1 |          1.6022 |         1.5686 | 65.2 |
|     1.92 |  119.4 |   139.1 |    174.1 |          1.5822 |         1.5488 |   67 |
|   1.9996 |  123.1 |   140.8 |    174.1 |            1.56 |         1.5192 | 68.7 |
|   2.0843 |  125.2 |   143.1 |    174.1 |          1.5377 |         1.5012 | 70.4 |
|   2.1777 |  128.6 |   145.1 |    174.1 |          1.5128 |         1.4767 | 72.1 |
|   2.2803 |  131.4 |   147.1 |    174.1 |          1.4855 |         1.4477 | 73.8 |
|   2.3926 |  134.3 |   149.4 |    174.1 |          1.4558 |         1.4192 | 75.5 |
|   2.5166 |  137.1 |   150.8 |    174.1 |          1.4234 |         1.3875 | 77.3 |
|   2.6544 |  140.2 |   153.3 |    174.1 |          1.3877 |          1.353 |   79 |
|   2.8084 |  143.3 |   155.4 |    174.1 |          1.3489 |         1.3163 | 80.7 |
|   2.9825 |  146.9 |   157.7 |    174.1 |           1.305 |         1.2738 | 82.4 |
|   3.1805 |  149.9 |     160 |    174.1 |          1.2559 |         1.2248 | 84.1 |

#+call: test-dragoid-diagnostic(alpha=2.0)

#+RESULTS:
| R_0 prime | theta_0 | theta_90 | theta_inf | tilde R_90 prime | tilde R_c prime |  inc |
|----------+--------+---------+----------+-----------------+----------------+------|
|   1.0004 |      0 |      90 |    176.8 |          1.7144 |         1.6534 |    0 |
|        1 |    3.9 |      90 |    176.8 |          1.7155 |         1.6887 |  1.8 |
|   1.0005 |    1.5 |    90.2 |    176.8 |          1.7158 |         1.7118 |  3.5 |
|   1.0024 |    9.6 |    90.4 |    176.8 |          1.7147 |         1.6838 |  5.3 |
|   1.0045 |    9.8 |    90.6 |    176.8 |          1.7143 |         1.6931 |  7.1 |
|   1.0075 |   18.2 |      91 |    176.8 |           1.713 |         1.6882 |  8.9 |
|   1.0113 |   20.3 |    91.4 |    176.8 |          1.7115 |         1.6827 | 10.6 |
|   1.0158 |   22.3 |      92 |    176.8 |          1.7096 |         1.6738 | 12.4 |
|   1.0209 |     23 |    92.5 |    176.8 |          1.7077 |         1.6719 | 14.2 |
|   1.0266 |   26.8 |    93.2 |    176.8 |          1.7057 |         1.6741 | 15.9 |
|    1.033 |   28.6 |    93.9 |    176.8 |          1.7033 |         1.6732 | 17.7 |
|   1.0402 |   32.1 |    94.9 |    176.8 |          1.7011 |         1.6751 | 19.5 |
|   1.0486 |   35.7 |    95.5 |    176.8 |          1.6977 |         1.6603 | 21.3 |
|   1.0574 |     36 |    96.8 |    176.8 |          1.6939 |          1.657 |   23 |
|    1.067 |   42.1 |    97.4 |    176.8 |           1.691 |         1.6541 | 24.8 |
|   1.0776 |     44 |    98.9 |    176.8 |          1.6869 |         1.6487 | 26.6 |
|   1.0887 |   46.6 |    99.7 |    176.8 |          1.6834 |          1.651 | 28.4 |
|   1.1014 |   51.6 |   100.7 |    176.8 |          1.6781 |         1.6407 | 30.1 |
|   1.1141 |   58.2 |   102.3 |    176.8 |          1.6731 |         1.6451 | 31.9 |
|   1.1289 |   58.4 |   103.4 |    176.8 |          1.6675 |         1.6334 | 33.7 |
|   1.1441 |   58.5 |   104.8 |    176.8 |          1.6615 |         1.6357 | 35.4 |
|   1.1606 |   63.5 |   106.2 |    176.8 |          1.6558 |         1.6348 | 37.2 |
|   1.1794 |   67.5 |   107.6 |    176.8 |          1.6478 |         1.6137 |   39 |
|    1.199 |   72.6 |   108.6 |    176.8 |          1.6393 |         1.5924 | 40.8 |
|   1.2192 |   72.8 |   111.3 |    176.8 |          1.6317 |         1.5831 | 42.5 |
|   1.2404 |   74.6 |   111.7 |    176.8 |          1.6249 |         1.5781 | 44.3 |
|   1.2626 |   79.6 |   113.5 |    176.8 |          1.6159 |         1.5782 | 46.1 |
|   1.2873 |   80.2 |   115.4 |    176.8 |          1.6084 |         1.5695 | 47.8 |
|   1.3153 |   82.7 |     117 |    176.8 |          1.5963 |         1.5405 | 49.6 |
|   1.3431 |     89 |   118.8 |    176.8 |          1.5837 |         1.5429 | 51.4 |
|   1.3731 |   89.5 |   119.8 |    176.8 |          1.5721 |         1.5302 | 53.2 |
|   1.4045 |   92.1 |     122 |    176.8 |          1.5613 |         1.5221 | 54.9 |
|   1.4384 |   95.3 |   124.2 |    176.8 |          1.5484 |         1.5125 | 56.7 |
|   1.4752 |   99.1 |     125 |    176.8 |          1.5343 |         1.4943 | 58.5 |
|   1.5139 |  100.5 |   127.2 |    176.8 |          1.5197 |         1.4759 | 60.3 |
|   1.5548 |  103.5 |   129.3 |    176.8 |          1.5046 |         1.4664 |   62 |
|   1.5985 |  106.8 |   131.2 |    176.8 |          1.4893 |         1.4531 | 63.8 |
|   1.6453 |  108.5 |     132 |    176.8 |           1.472 |           1.44 | 65.6 |
|   1.6978 |  111.7 |   134.9 |    176.8 |          1.4519 |         1.4072 | 67.3 |
|   1.7537 |  115.4 |   136.4 |    176.8 |          1.4314 |         1.3821 | 69.1 |
|   1.8101 |  117.2 |   138.5 |    176.8 |          1.4126 |         1.3756 | 70.9 |
|   1.8746 |  121.8 |   140.6 |    176.8 |          1.3895 |         1.3515 | 72.7 |
|   1.9434 |  124.5 |   143.2 |    176.8 |          1.3651 |         1.3275 | 74.4 |
|   2.0175 |  127.3 |   144.3 |    176.8 |          1.3394 |          1.303 | 76.2 |
|   2.0992 |  131.2 |   146.6 |    176.8 |          1.3113 |         1.2731 |   78 |
|   2.1869 |  133.6 |   149.4 |    176.8 |          1.2816 |         1.2516 | 79.7 |
|   2.2864 |  137.8 |     152 |    176.8 |          1.2478 |         1.2161 | 81.5 |
|   2.3954 |  140.6 |   154.2 |    176.8 |          1.2115 |         1.1847 | 83.3 |
|   2.5197 |  144.1 |   157.2 |    176.8 |            1.17 |         1.1474 | 85.1 |
|   2.6646 |  149.4 |   159.8 |    176.8 |          1.1222 |          1.105 | 86.8 |

#+call: test-dragoid-diagnostic(alpha=1.0, mu=0.2)

#+RESULTS:
| R_0 prime | theta_0 | theta_90 | theta_inf | tilde R_90 prime | tilde R_c prime |  inc |
|----------+--------+---------+----------+-----------------+----------------+------|
|   1.0001 |      0 |      90 |    152.4 |          2.0699 |         1.9984 |    0 |
|   1.0002 |    2.2 |      90 |    152.4 |          2.0703 |         2.0111 |  1.3 |
|   1.0008 |    4.9 |    90.1 |    152.4 |           2.071 |         2.0239 |  2.5 |
|    1.002 |    5.1 |    90.3 |    152.4 |          2.0715 |         2.0278 |  3.8 |
|   1.0033 |   13.6 |    90.5 |    152.4 |          2.0729 |         2.0542 |  5.1 |
|    1.006 |   13.8 |    90.7 |    152.4 |          2.0725 |         2.0349 |  6.4 |
|   1.0088 |   16.7 |    91.1 |    152.4 |           2.073 |         2.0388 |  7.6 |
|   1.0121 |   19.9 |    91.4 |    152.4 |          2.0736 |         2.0531 |  8.9 |
|   1.0162 |   22.8 |    91.9 |    152.4 |          2.0737 |         2.0511 | 10.2 |
|   1.0207 |   23.2 |    92.4 |    152.4 |          2.0745 |         2.0605 | 11.5 |
|   1.0259 |     26 |      93 |    152.4 |          2.0755 |         2.0634 | 12.7 |
|   1.0319 |   29.4 |    93.6 |    152.4 |          2.0765 |         2.0528 |   14 |
|   1.0382 |   31.2 |    94.2 |    152.4 |          2.0774 |         2.0586 | 15.3 |
|   1.0454 |   31.5 |      95 |    152.4 |          2.0779 |          2.056 | 16.6 |
|   1.0536 |     38 |    95.8 |    152.4 |          2.0784 |         2.0334 | 17.8 |
|   1.0622 |     41 |    96.6 |    152.4 |          2.0799 |         2.0308 | 19.1 |
|   1.0717 |   43.8 |    97.3 |    152.4 |          2.0805 |         2.0126 | 20.4 |
|   1.0817 |     46 |    98.5 |    152.4 |          2.0814 |         2.0126 | 21.7 |
|   1.0918 |   47.6 |    99.4 |    152.4 |          2.0852 |         2.0339 | 22.9 |
|   1.1032 |   48.7 |   100.1 |    152.4 |          2.0867 |         2.0391 | 24.2 |
|   1.1156 |   54.7 |   101.5 |    152.4 |          2.0884 |         2.0397 | 25.5 |
|   1.1289 |     53 |   102.2 |    152.4 |          2.0898 |         2.0497 | 26.7 |
|   1.1435 |   57.5 |   103.6 |    152.4 |          2.0915 |         2.0464 |   28 |
|   1.1593 |   61.6 |   104.5 |    152.4 |          2.0919 |         2.0277 | 29.3 |
|   1.1759 |   63.7 |   105.9 |    152.4 |          2.0926 |         2.0282 | 30.6 |
|    1.194 |   65.6 |   107.3 |    152.4 |          2.0944 |         2.0222 | 31.8 |
|   1.2132 |   69.8 |   108.3 |    152.4 |          2.0962 |          2.013 | 33.1 |
|   1.2328 |   70.9 |   109.7 |    152.4 |          2.0993 |         2.0314 | 34.4 |
|   1.2539 |   74.3 |     111 |    152.4 |          2.1018 |         2.0411 | 35.7 |
|   1.2776 |   76.6 |   112.5 |    152.4 |          2.1037 |         2.0326 | 36.9 |
|   1.3032 |     80 |   113.8 |    152.4 |          2.1049 |         2.0139 | 38.2 |
|     1.33 |   82.9 |   115.3 |    152.4 |          2.1079 |         2.0095 | 39.5 |
|   1.3589 |   85.9 |   116.6 |    152.4 |          2.1099 |         2.0071 | 40.8 |
|   1.3878 |   86.3 |   118.1 |    152.4 |          2.1156 |         2.0527 |   42 |
|   1.4219 |   90.3 |   119.7 |    152.4 |          2.1167 |         2.0308 | 43.3 |
|   1.4577 |   93.5 |   121.1 |    152.4 |          2.1196 |         2.0174 | 44.6 |
|   1.4963 |   96.7 |   122.8 |    152.4 |          2.1232 |         2.0098 | 45.9 |
|   1.5384 |   99.3 |   124.3 |    152.4 |           2.126 |         1.9958 | 47.1 |
|   1.5821 |  101.6 |   126.1 |    152.4 |          2.1325 |         2.0069 | 48.4 |
|   1.6302 |  103.7 |   127.4 |    152.4 |          2.1376 |         2.0096 | 49.7 |
|   1.6832 |    107 |   129.3 |    152.4 |          2.1426 |          1.998 | 50.9 |
|   1.7394 |  109.2 |   130.9 |    152.4 |          2.1511 |         2.0081 | 52.2 |
|   1.8002 |    112 |   132.7 |    152.4 |          2.1613 |         2.0199 | 53.5 |
|   1.8715 |  114.8 |   134.4 |    152.4 |          2.1688 |         1.9724 | 54.8 |
|    1.942 |    117 |   136.3 |    152.4 |          2.1863 |         2.0263 |   56 |
|   2.0246 |  119.7 |   138.2 |    152.4 |          2.2039 |         2.0167 | 57.3 |
|   2.1165 |  122.5 |   140.1 |    152.4 |          2.2267 |          2.006 | 58.6 |
|   2.2172 |  125.6 |   142.3 |    152.4 |          2.2612 |         2.0094 | 59.9 |
|   2.3261 |  127.5 |   144.6 |    152.4 |          2.3171 |           2.08 | 61.1 |
|   2.4591 |  130.7 |     147 |    152.4 |          2.3945 |         2.0424 | 62.4 |

#+call: test-dragoid-diagnostic(alpha=4.0, mu=0.2)

#+RESULTS:
| R_0 prime | theta_0 | theta_90 | theta_inf | tilde R_90 prime | tilde R_c prime |  inc |
|----------+--------+---------+----------+-----------------+----------------+------|
|   0.9999 |      0 |      90 |    172.3 |          1.6506 |            1.6 |    0 |
|   1.0001 |      3 |      90 |    172.3 |          1.6507 |         1.6038 |  1.7 |
|   1.0008 |    4.9 |    90.2 |    172.3 |          1.6508 |         1.6097 |  3.4 |
|    1.002 |    7.7 |    90.4 |    172.3 |          1.6509 |         1.6119 |    5 |
|    1.004 |   10.9 |    90.6 |    172.3 |          1.6509 |         1.6047 |  6.7 |
|   1.0064 |   13.6 |    90.9 |    172.3 |          1.6504 |         1.6003 |  8.4 |
|   1.0093 |   16.3 |    91.1 |    172.3 |           1.649 |         1.5986 | 10.1 |
|   1.0126 |   18.9 |    91.4 |    172.3 |          1.6469 |         1.6058 | 11.8 |
|   1.0166 |   23.9 |    92.4 |    172.3 |          1.6452 |         1.6003 | 13.4 |
|   1.0211 |   24.2 |    92.7 |    172.3 |          1.6443 |         1.6047 | 15.1 |
|   1.0266 |   27.6 |      93 |    172.3 |          1.6412 |         1.5901 | 16.8 |
|   1.0323 |   29.1 |    94.3 |    172.3 |          1.6389 |         1.5855 | 18.5 |
|   1.0382 |   31.5 |    94.6 |    172.3 |          1.6375 |         1.5932 | 20.2 |
|   1.0439 |   37.2 |    94.9 |    172.3 |          1.6357 |         1.6245 | 21.8 |
|   1.0519 |   37.6 |    96.6 |    172.3 |          1.6327 |         1.6118 | 23.5 |
|   1.0613 |   40.8 |    97.1 |    172.3 |          1.6279 |          1.585 | 25.2 |
|   1.0697 |   42.9 |    97.6 |    172.3 |          1.6239 |         1.5912 | 26.9 |
|   1.0796 |   43.1 |    99.4 |    172.3 |          1.6197 |         1.5821 | 28.6 |
|   1.0898 |   44.9 |   100.2 |    172.3 |          1.6159 |         1.5839 | 30.2 |
|   1.1009 |   46.8 |   101.3 |    172.3 |          1.6114 |         1.5824 | 31.9 |
|   1.1133 |   53.7 |   103.1 |    172.3 |          1.6056 |         1.5682 | 33.6 |
|   1.1266 |   56.5 |   103.7 |    172.3 |          1.6005 |         1.5576 | 35.3 |
|   1.1397 |     61 |   105.1 |    172.3 |          1.5955 |         1.5608 |   37 |
|   1.1546 |   63.6 |   106.1 |    172.3 |           1.589 |          1.548 | 38.6 |
|   1.1697 |   61.4 |   107.6 |    172.3 |          1.5836 |         1.5503 | 40.3 |
|   1.1871 |   69.1 |   109.1 |    172.3 |          1.5757 |         1.5249 |   42 |
|   1.2042 |   67.8 |   110.3 |    172.3 |          1.5697 |         1.5208 | 43.7 |
|   1.2227 |   72.7 |     112 |    172.3 |          1.5627 |         1.5071 | 45.4 |
|   1.2416 |   75.3 |   113.6 |    172.3 |          1.5564 |         1.5047 |   47 |
|   1.2621 |   78.3 |   114.4 |    172.3 |          1.5488 |         1.4944 | 48.7 |
|   1.2833 |   82.8 |   116.6 |    172.3 |          1.5418 |         1.4907 | 50.4 |
|   1.3074 |   85.6 |   118.8 |    172.3 |          1.5321 |         1.4725 | 52.1 |
|   1.3327 |   85.8 |   120.6 |    172.3 |          1.5226 |         1.4539 | 53.8 |
|   1.3584 |   90.9 |   121.1 |    172.3 |          1.5143 |         1.4549 | 55.4 |
|   1.3862 |     91 |   123.6 |    172.3 |          1.5043 |         1.4461 | 57.1 |
|   1.4172 |   96.7 |   125.1 |    172.3 |          1.4931 |         1.4292 | 58.8 |
|   1.4478 |   97.1 |     127 |    172.3 |          1.4839 |         1.4246 | 60.5 |
|   1.4811 |  100.3 |   128.9 |    172.3 |          1.4738 |         1.4182 | 62.2 |
|   1.5171 |  103.6 |   130.9 |    172.3 |          1.4621 |         1.4041 | 63.8 |
|   1.5553 |  105.7 |     134 |    172.3 |          1.4512 |         1.3911 | 65.5 |
|   1.5971 |  109.7 |   135.1 |    172.3 |          1.4392 |         1.3679 | 67.2 |
|   1.6407 |  112.4 |   137.9 |    172.3 |          1.4285 |         1.3535 | 68.9 |
|   1.6869 |  116.3 |   140.7 |    172.3 |          1.4186 |         1.3458 | 70.6 |
|   1.7394 |  120.5 |   144.2 |    172.3 |          1.4076 |         1.3265 | 72.2 |
|   1.7943 |  121.1 |   147.1 |    172.3 |          1.4001 |         1.3187 | 73.9 |
|   1.8563 |  125.4 |     151 |    172.3 |          1.3946 |         1.2966 | 75.6 |
|   1.9239 |  128.9 |   155.4 |    172.3 |          1.3981 |         1.2851 | 77.3 |
|   2.0022 |  134.3 |   160.4 |    172.3 |          1.4178 |         1.2637 | 78.9 |
|   2.0908 |  137.9 |   165.4 |    172.3 |          1.4858 |           1.26 | 80.6 |
|   2.2011 |  144.6 |   170.1 |    172.3 |          1.7237 |         1.2706 | 82.3 |

#+call: test-dragoid-diagnostic(alpha=4.0, mu=0.8)

#+RESULTS:
| R_0 prime | theta_0 | theta_90 | theta_inf | tilde R_90 prime | tilde R_c prime |  inc |
|----------+--------+---------+----------+-----------------+----------------+------|
|        1 |      0 |      90 |    155.1 |          1.8645 |         1.8116 |    0 |
|   1.0001 |    2.2 |      90 |    155.1 |          1.8646 |         1.8273 |  1.3 |
|   1.0006 |    2.4 |    90.1 |    155.1 |          1.8648 |         1.8389 |  2.7 |
|   1.0017 |    6.3 |    90.2 |    155.1 |          1.8647 |         1.8411 |    4 |
|   1.0033 |   10.9 |    90.4 |    155.1 |          1.8643 |         1.8393 |  5.3 |
|   1.0053 |   11.3 |    90.7 |    155.1 |          1.8638 |         1.8392 |  6.6 |
|   1.0077 |   15.2 |      91 |    155.1 |          1.8636 |         1.8507 |    8 |
|   1.0109 |   18.5 |    91.3 |    155.1 |          1.8627 |         1.8317 |  9.3 |
|   1.0143 |   18.8 |    91.7 |    155.1 |          1.8622 |         1.8297 | 10.6 |
|   1.0186 |   23.8 |    92.1 |    155.1 |          1.8608 |         1.8144 |   12 |
|   1.0231 |     24 |    92.6 |    155.1 |          1.8596 |         1.8079 | 13.3 |
|   1.0278 |   26.7 |    93.3 |    155.1 |          1.8595 |         1.8096 | 14.6 |
|   1.0328 |   29.2 |    93.8 |    155.1 |          1.8593 |         1.8231 | 15.9 |
|   1.0377 |   33.1 |    94.5 |    155.1 |          1.8601 |         1.8658 | 17.3 |
|   1.0438 |   34.6 |    95.2 |    155.1 |          1.8602 |          1.881 | 18.6 |
|   1.0526 |   35.2 |    95.7 |    155.1 |          1.8557 |         1.8343 | 19.9 |
|   1.0605 |   39.4 |    97.1 |    155.1 |          1.8556 |         1.8324 | 21.3 |
|   1.0693 |   42.9 |    97.4 |    155.1 |          1.8542 |         1.8205 | 22.6 |
|   1.0777 |   44.9 |    97.9 |    155.1 |          1.8525 |         1.8288 | 23.9 |
|   1.0876 |   45.1 |    99.7 |    155.1 |          1.8504 |         1.8156 | 25.3 |
|   1.0981 |   46.4 |   100.1 |    155.1 |          1.8488 |         1.8037 | 26.6 |
|   1.1089 |   52.2 |   101.3 |    155.1 |          1.8464 |         1.8081 | 27.9 |
|   1.1196 |   48.7 |     102 |    155.1 |           1.846 |         1.8298 | 29.2 |
|   1.1332 |   56.4 |   103.5 |    155.1 |          1.8422 |         1.7977 | 30.6 |
|   1.1458 |   60.7 |   104.7 |    155.1 |          1.8414 |         1.8032 | 31.9 |
|   1.1602 |   58.6 |   105.5 |    155.1 |           1.839 |         1.7964 | 33.2 |
|   1.1755 |   68.1 |     107 |    155.1 |          1.8361 |         1.7822 | 34.6 |
|   1.1913 |   63.2 |   107.9 |    155.1 |          1.8335 |         1.7792 | 35.9 |
|    1.208 |   66.6 |   109.7 |    155.1 |          1.8334 |         1.7775 | 37.2 |
|   1.2254 |   68.5 |   110.2 |    155.1 |          1.8315 |         1.7814 | 38.5 |
|   1.2436 |   71.3 |   112.1 |    155.1 |          1.8306 |         1.7943 | 39.9 |
|    1.264 |   74.6 |   114.2 |    155.1 |          1.8287 |         1.7806 | 41.2 |
|   1.2865 |   79.1 |   114.6 |    155.1 |          1.8258 |         1.7467 | 42.5 |
|    1.309 |     81 |   116.4 |    155.1 |          1.8244 |         1.7351 | 43.9 |
|   1.3335 |   84.5 |   118.1 |    155.1 |          1.8246 |         1.7142 | 45.2 |
|   1.3574 |   86.2 |   119.9 |    155.1 |          1.8261 |         1.7231 | 46.5 |
|   1.3832 |   88.1 |   121.9 |    155.1 |          1.8306 |          1.727 | 47.8 |
|   1.4104 |   90.1 |   123.2 |    155.1 |          1.8346 |          1.737 | 49.2 |
|   1.4402 |     92 |   125.4 |    155.1 |          1.8402 |         1.7416 | 50.5 |
|   1.4733 |   97.3 |   127.6 |    155.1 |          1.8446 |         1.7153 | 51.8 |
|   1.5093 |   99.9 |   129.7 |    155.1 |          1.8535 |         1.6872 | 53.2 |
|   1.5427 |   97.8 |     132 |    155.1 |          1.8709 |         1.7357 | 54.5 |
|   1.5825 |  102.1 |   134.4 |    155.1 |          1.8908 |         1.7163 | 55.8 |
|   1.6246 |  106.9 |   136.2 |    155.1 |          1.9198 |          1.704 | 57.1 |
|   1.6718 |  109.8 |   139.3 |    155.1 |          1.9603 |         1.6767 | 58.5 |
|   1.7198 |    112 |   142.2 |    155.1 |          2.0235 |         1.7101 | 59.8 |
|   1.7741 |  114.5 |   144.9 |    155.1 |          2.1169 |         1.7455 | 61.1 |
|   1.8383 |  119.8 |   147.7 |    155.1 |          2.2647 |         1.7245 | 62.5 |
|   1.9079 |    123 |   150.6 |    155.1 |          2.5366 |         1.7744 | 63.8 |
|    1.993 |  129.8 |   153.3 |    155.1 |          3.1556 |         1.8812 | 65.1 |


**** Wilkinoid
#+name: test-wave-diagnostic
#+header: :var phase=0.0 amplitude=0.1 wavenumber=1.0
#+BEGIN_SRC python :eval yes :return result
  import sys
  import numpy as np
  import bow_projection as bp
  import bow_diagnostic
  import standing_wave

  bp.N_NEIGHBORHOOD = 50
  bp.DEGREE_POLY_NEIGHBORHOOD = 2
  bp.SCALE_NEIGHBORHOOD = 0.03
  bp.DEGREE_POLY_NEIGHBORHOOD_90 = 2
  bp.SCALE_NEIGHBORHOOD_90 = 0.01

  shape = standing_wave.StandingWave(
      bp.wilkinoid_R_theta, amplitude=amplitude, wavenumber=wavenumber, phase=phase)
  th_inf = bp.theta_infinity(shape)
  inclinations = np.linspace(0.0, th_inf - np.pi/2, 19)
  tab = bow_diagnostic.parameter_table(inclinations, shape)

  result = [tab.colnames, None] + list(tab.as_array())

#+END_SRC

#+RESULTS: test-wave-diagnostic
| R_0 prime | theta_0 | theta_90 | theta_inf | tilde R_90 prime | tilde R_c prime | inc |
|----------+--------+---------+----------+-----------------+----------------+-----|
|      1.1 |      0 |      90 |      180 |          1.5746 |         1.4474 |   0 |
|   1.1019 |    7.2 |    90.3 |      180 |          1.5747 |         1.4475 |   5 |
|   1.1076 |   14.5 |    91.2 |      180 |          1.5751 |         1.4479 |  10 |
|   1.1172 |   21.9 |    92.7 |      180 |          1.5758 |         1.4487 |  15 |
|   1.1311 |   29.3 |    94.8 |      180 |          1.5768 |         1.4497 |  20 |
|   1.1497 |   36.9 |    97.4 |      180 |          1.5781 |         1.4511 |  25 |
|   1.1736 |   44.7 |   100.7 |      180 |          1.5797 |         1.4528 |  30 |
|   1.2036 |   52.7 |   104.5 |      180 |          1.5817 |         1.4549 |  35 |
|    1.241 |     61 |   108.9 |      180 |          1.5841 |         1.4575 |  40 |
|   1.2875 |   69.7 |   113.8 |      180 |           1.587 |         1.4606 |  45 |
|   1.3455 |     79 |   119.3 |      180 |          1.5904 |         1.4644 |  50 |
|    1.419 |   88.8 |   125.4 |      180 |          1.5944 |          1.469 |  55 |
|    1.514 |   99.4 |     132 |      180 |          1.5989 |         1.4747 |  60 |
|   1.6408 |  110.9 |   139.1 |      180 |          1.6036 |         1.4816 |  65 |
|   1.8184 |  123.4 |   146.7 |      180 |          1.6081 |         1.4892 |  70 |
|   2.0864 |  136.6 |   154.6 |      180 |          1.6117 |         1.4963 |  75 |
|   2.5463 |  150.6 |   162.9 |      180 |          1.6133 |         1.5009 |  80 |
|   3.5983 |  165.1 |   171.4 |      180 |          1.6129 |         1.5014 |  85 |
|      nan |    nan |     nan |      180 |             nan |            nan |  90 |


**** Generate the data for different shapes and waves

#+name: run-save-wave
#+header: :var A=0.1 N=1.5
#+BEGIN_SRC sh :results verbatim
  for shape in wilkinoid cantoid-beta002000 ancantoid-xi080-beta000500 dragoid-alpha100; do
      python save-wave-data.py $shape $A $N
      echo
  done
#+END_SRC

#+RESULTS: run-save-wave
: wilkinoid-wave-A010-N15.jsoncantoid-beta002000-wave-A010-N15.jsonancantoid-xi080-beta000500-wave-A010-N15.jsondragoid-alpha100-wave-A010-N15.json

#+call: run-save-wave(A=0.1, N=1)

#+RESULTS:
: wilkinoid-wave-A010-N10.json
: cantoid-beta002000-wave-A010-N10.json
: ancantoid-xi080-beta000500-wave-A010-N10.json
: dragoid-alpha100-wave-A010-N10.json

#+call: run-save-wave(A=0.05, N=2)

#+RESULTS:
: wilkinoid-wave-A005-N20.json
: cantoid-beta002000-wave-A005-N20.json
: ancantoid-xi080-beta000500-wave-A005-N20.json
: dragoid-alpha100-wave-A005-N20.json


#+call: run-save-wave(A=0.01, N=5)

#+RESULTS:
: wilkinoid-wave-A001-N50.json
: cantoid-beta002000-wave-A001-N50.json
: ancantoid-xi080-beta000500-wave-A001-N50.json
: dragoid-alpha100-wave-A001-N50.json

*** Slope of Rc-R90 graph from analytic estimate
|    N | (1 - cos(N\pi/2))/N |
|------+-------------------|
| 0.25 |              0.30 |
|  0.5 |              0.59 |
|  1.0 |              1.00 |
|  1.5 |              1.14 |
|  2.0 |              1.00 |
|  2.5 |              0.68 |
|  3.0 |              0.33 |
#+TBLFM: $2=(1 - cos($1 90))/$1 ; f2

